artillery.yml
config:
  target: 'http://localhost:3000'
  ensure:
    p95: 2000
    maxErrorRate: 1
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: "warm up"
    - duration: 180
      arrivalRate: 100
      rampTo: 500
      name: "stress test"
  # environments:
  #   production:
  variables:
    term:
      - "1W"
      - "1M"
      - "3M"
      - "1Y"
      - "5Y"
  payload:
    path: "database/seedfiles/stocks.csv"
    fields:
      - "stock_symbol"
scenarios:
  - name: "Check stock first page"
    weight: 1
    flow:
    - get:
        url: "/api/graph/stockHistory?id={{ stock_symbol }}&term=1D"
  - name: "Check stock multiple pages"
    weight: 1
    flow:
    - get:
        url: "/api/graph/stockHistory?id={{ stock_symbol }}&term=1D"
        capture:
          json: "$.symbol"
          as: "symbol"
    - think: 2
    - get:
        url: "/api/graph/stockHistory?id={{ symbol }}&term={{ term }}"
    - think: 2
    - get:
        url: "/api/graph/stockHistory?id={{ symbol }}&term={{ term }}"
  - name: "Check stock 1D and 5Y"
    weight: 1
    flow:
    - get:
        url: "/api/graph/stockHistory?id={{ stock_symbol }}&term=1D"
        capture:
          json: "$.symbol"
          as: "symbol"
    - think: 2
    - get:
        url: "/api/graph/stockHistory?id={{ symbol }}&term=5Y"